In [1]:
x = 5
y = 10


sum = x + y
print(sum)

15

In [2]:
x = 10
y = 5
print(x**y)
print(y*x)
print(y/x)

100000
50
0.5

In [3]:
x = 10.5
y = 5
z = x + y
type (z)

float

In [4]:
type(x)

float

In [5]:
a = "20"
b = "30"
c = a + b
print (c)

2030

In [6]:
r = 2
pi = 3.14
area = pi*r**2
print(area)

12.56

In [7]:
name = 'Dawid'
job = 'Intellignce Analyst'

longer_string = "My name is "+ name + " " + "and I am a " + job
print(longer_string)


# super useful - f string
phrase = f"My name is {name} and I am a {job}"
print(phrase)

My name is Dawid and I am a Intellignce Analyst
My name is Dawid and I am a Intellignce Analyst

In [8]:
name = 'Steph'
surname = 'Curry'
team = "Golden State Warriors"

phrase = f"My favouring player is {name} {surname} and he plays for the team called {team}"

print(phrase)

My favouring player is Steph Curry and he plays for the team called Golden State Warriors

In [9]:
cin_plan = 666
total_pop = 15000
rp10k = (cin_plan / total_pop) * 10000
explanations = f" The rate of cin plans per 10k children is {rp10k}"
print(explanations)

 The rate of cin plans per 10k children is 444.0

In [10]:
filename = "c://desktop/data/903_header.csv"
print(filename)

substring = filename[10]
print(substring)

substring2 = filename[12:20]
print(substring2)

substring3 = filename[-4:]
print(substring3)

substring4 = filename[17:-4]
print(substring4)

long_phrase = f"The file name is: {substring4}"
print(long_phrase)

c://desktop/data/903_header.csv
p
data/903
.csv
903_header
The file name is: 903_header

In [11]:
phrase = "Dawid Tycki"
reversed = phrase[-1::-1]
print(reversed)

ikcyT diwaD

In [12]:
slice_this_phrase = 'dog cat racoon'

d = slice_this_phrase[0:3]
c = slice_this_phrase[4:7]
r = slice_this_phrase[8:]
print(d)
print(c)
print(r)

dog
cat
racoon

In [13]:
list_1 = [1,2,3,4,phrase,long_phrase,"hi",d,c,d]
print(type(list_1))
print(list_1)

<class 'list'>
[1, 2, 3, 4, 'Dawid Tycki', 'The file name is: 903_header', 'hi', 'dog', 'cat', 'dog']

In [14]:
colours = ['red','blue','green','purple']
print(colours)
print(colours[-1::-1])
print(colours[2:])

['red', 'blue', 'green', 'purple']
['purple', 'green', 'blue', 'red']
['green', 'purple']

In [15]:
colours = ['red','blue','green','purple']
colours.append(['teal','orange'])  #append will add not as elements but as a list within a list, use extend instead
print(colours)
print(colours[4])
print(colours[4][0])

['red', 'blue', 'green', 'purple', ['teal', 'orange']]
['teal', 'orange']
teal

In [16]:
colours = ['red','blue','green','purple']
more_colours = ['bronw','gold','white']

colours.extend(more_colours)
print(colours)
colours.append('gold')
print(colours)

['red', 'blue', 'green', 'purple', 'bronw', 'gold', 'white']
['red', 'blue', 'green', 'purple', 'bronw', 'gold', 'white', 'gold']

In [17]:
colours.remove('gold') # removes the first instance of 'gold'
print(colours)

['red', 'blue', 'green', 'purple', 'bronw', 'white', 'gold']

In [18]:
my_string = "here's a string"

Session 2

In [19]:
num_1 = 1
num_2 = 2.0
name = 'Dawid'
list_x = [1,2,3,4]

print(type(list_x))

list_x.append([10,11,23])
list_x.extend([4,6,6,6,6,6])
list_x

<class 'list'>

[1, 2, 3, 4, [10, 11, 23], 4, 6, 6, 6, 6, 6]

In [20]:
list_x[1::2]

[2, 4, 4, 6, 6]

In [21]:
list_2 = range(11)
print(list_2)

range(0, 11)

In [22]:
list_2 = list(range(11))
print(list_2)

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [23]:
num_2 = str(num_2)
print(type(num_2))

<class 'str'>

In [24]:
num_2 = float(num_2)  # as this string was 2.0, we cannot convert it to int - othwersie, convert str to float to int
print(type(num_2))

<class 'float'>

In [25]:
numbers_list = [2,4,3,5,1,6]
print(numbers_list)

[2, 4, 3, 5, 1, 6]

In [26]:
numbers_list.sort()
print(numbers_list)

numbers_list.sort(reverse=True)
print(numbers_list)

[1, 2, 3, 4, 5, 6]
[6, 5, 4, 3, 2, 1]

In [27]:
dict_1 = {'key1':'value','key2':'value'} # each pair is an entry
print(type(dict_1))

<class 'dict'>

In [28]:
dawid= {'Name':'Dawid',
        'Job title':'Analyst',
        'Hours':'36',
        'Salary':50}


colours_dict = {'Will':dawid,
                'Roman':['black','blue'],
                'Daniela':14,
                'Julka':{'Monday':'Red',
                         'Sunday':'Orange',
                         'Others':'Black'}}

In [29]:
foods = {'KFC':['Buckets','fillets'],
         'Mac':'burgers',
         'Wendys':{'Weekdays':'ultra processed',
                   'Weekends':'super healthy'},
        'Domek':'mama food'}

In [30]:
print(foods.keys())
print(foods.values())

print(foods.items())  # items of tuples

print('Curry house' in foods)
print('Wendys' in foods)

dict_keys(['KFC', 'Mac', 'Wendys', 'Domek'])
dict_values([['Buckets', 'fillets'], 'burgers', {'Weekdays': 'ultra processed', 'Weekends': 'super healthy'}, 'mama food'])
dict_items([('KFC', ['Buckets', 'fillets']), ('Mac', 'burgers'), ('Wendys', {'Weekdays': 'ultra processed', 'Weekends': 'super healthy'}), ('Domek', 'mama food')])
False
True

In [31]:
foods['Wendys']

{'Weekdays': 'ultra processed', 'Weekends': 'super healthy'}

In [32]:
foods['Kebab shop'] = 'Kebabs'
foods

{'KFC': ['Buckets', 'fillets'],
 'Mac': 'burgers',
 'Wendys': {'Weekdays': 'ultra processed', 'Weekends': 'super healthy'},
 'Domek': 'mama food',
 'Kebab shop': 'Kebabs'}

In [33]:
foods["Joy's food"] = ['green curry','fried chicken','most amazing foods']
foods

{'KFC': ['Buckets', 'fillets'],
 'Mac': 'burgers',
 'Wendys': {'Weekdays': 'ultra processed', 'Weekends': 'super healthy'},
 'Domek': 'mama food',
 'Kebab shop': 'Kebabs',
 "Joy's food": ['green curry', 'fried chicken', 'most amazing foods']}

In [34]:
print(foods.values())
print(foods)
print(foods.items())

dict_values([['Buckets', 'fillets'], 'burgers', {'Weekdays': 'ultra processed', 'Weekends': 'super healthy'}, 'mama food', 'Kebabs', ['green curry', 'fried chicken', 'most amazing foods']])
{'KFC': ['Buckets', 'fillets'], 'Mac': 'burgers', 'Wendys': {'Weekdays': 'ultra processed', 'Weekends': 'super healthy'}, 'Domek': 'mama food', 'Kebab shop': 'Kebabs', "Joy's food": ['green curry', 'fried chicken', 'most amazing foods']}
dict_items([('KFC', ['Buckets', 'fillets']), ('Mac', 'burgers'), ('Wendys', {'Weekdays': 'ultra processed', 'Weekends': 'super healthy'}), ('Domek', 'mama food'), ('Kebab shop', 'Kebabs'), ("Joy's food", ['green curry', 'fried chicken', 'most amazing foods'])])

In [35]:
import pandas as pd

filepath = 'https://raw.githubusercontent.com/data-to-insight/csc-validator-be-903/main/tests/fake_data/header.csv'

header_fake = pd.read_csv(filepath)

In [36]:
print(header_fake.head())
print(header_fake.tail())

    CHILD  SEX         DOB ETHNIC            UPN  MOTHER MC_DOB
0  566910    2  27/03/2008   WROM  D051910639385     NaN    NaN
1  384923    2  09/09/2011   REFU  L034811502612     NaN    NaN
2  709901    1  14/02/2013   ABAN  Y021751958510     NaN    NaN
3  550084    2  04/05/2008   AOTH  R095578985099     NaN    NaN
4  710229    2  15/04/2002   REFU  Z095096287583     NaN    NaN
       CHILD  SEX         DOB ETHNIC            UPN  MOTHER MC_DOB
2670  152113    1  06/06/2003   WBRI  K096794376750     NaN    NaN
2671  481370    2  12/02/2008   BAFR  C014150452081     NaN    NaN
2672  791577    1  28/05/2011   WBRI  Q009369089812     NaN    NaN
2673  238470    1  21/11/2013   AIND  P095222532769     NaN    NaN
2674  437361    1  15/12/2012   WROM  G018001328504     NaN    NaN

In [37]:
print(header_fake.info())
header_fake.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2675 entries, 0 to 2674
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   CHILD   2675 non-null   int64
 1   SEX     2675 non-null   int64
 2   DOB     2675 non-null   object
 3   ETHNIC  2675 non-null   object
 4   UPN     2675 non-null   object
 5   MOTHER  1 non-null      float64
 6   MC_DOB  1 non-null      object
dtypes: float64(1), int64(2), object(4)
memory usage: 146.4+ KB
None

               CHILD          SEX  MOTHER
count    2675.000000  2675.000000     1.0
mean   501946.342430     1.501682     1.0
std    288753.842589     0.500091     NaN
min        32.000000     1.000000     1.0
25%    247684.000000     1.000000     1.0
50%    510000.000000     2.000000     1.0
75%    757149.500000     2.000000     1.0
max    999397.000000     2.000000     1.0

In [38]:
# dict of lists
d_1 = {'Col1':[1,2,3],
       'Col2':['A','B','C'],
       'Col3':['foo','bar','baz']}

df_1 = pd.DataFrame(d_1)
print(df_1)

# list of dicts
df_2 = pd.DataFrame([
    {'column1':1,
     'column2':'A',
     'column3':'foo'},
     {'column1':2,
     'column2':'B',
     'column3':'bar'},
     {'column1':13,
     'column2':'C',
     'column3':'baz'}
]

)
print(df_2)

   Col1 Col2 Col3
0     1    A  foo
1     2    B  bar
2     3    C  baz
   column1 column2 column3
0        1       A     foo
1        2       B     bar
2       13       C     baz

In [39]:
employees = pd.DataFrame([
    {'Forename':'Dawid',
     'Surname':'Tycki',
     'Salary':'48000',
     'Job title':'Intelligence Analyst'},
     {'Forename':'Doug',
     'Surname':'Sharp',
     'Salary':'49000',
     'Job title':'BO Intelligence Analyst'},
     {'Forename':'Soana',
     'Surname':'Pole',
     'Salary':'55000',
     'Job title':'Intelligence Analyst - Team leader'},
     {'Forename':'Paloma',
     'Surname':'Casey',
     'Salary':'49000',
     'Job title':'MARVE Intelligence Analyst'},
     {'Forename':'Pete',
     'Surname':'Leaworthy',
     'Salary':'47000',
     'Job title':'SEN Intelligence Analyst'}

]
)
print(employees)

  Forename    Surname Salary                           Job title
0    Dawid      Tycki  48000                Intelligence Analyst
1     Doug      Sharp  49000             BO Intelligence Analyst
2    Soana       Pole  55000  Intelligence Analyst - Team leader
3   Paloma      Casey  49000          MARVE Intelligence Analyst
4     Pete  Leaworthy  47000            SEN Intelligence Analyst

In [40]:
employees.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Forename   5 non-null      object
 1   Surname    5 non-null      object
 2   Salary     5 non-null      object
 3   Job title  5 non-null      object
dtypes: object(4)
memory usage: 288.0+ bytes

In [41]:
print(employees['Salary'])
print(employees[['Surname','Job title']])

0    48000
1    49000
2    55000
3    49000
4    47000
Name: Salary, dtype: object
     Surname                           Job title
0      Tycki                Intelligence Analyst
1      Sharp             BO Intelligence Analyst
2       Pole  Intelligence Analyst - Team leader
3      Casey          MARVE Intelligence Analyst
4  Leaworthy            SEN Intelligence Analyst

In [42]:
employees['Salary'] = employees['Salary'].astype('int')
print(employees.dtypes)

Forename     object
Surname      object
Salary        int64
Job title    object
dtype: object

In [43]:
mean_salary = employees['Salary'].mean()
sum_salary = employees['Salary'].sum()
max_salary = employees['Salary'].max()
min_salary = employees['Salary'].min()

print(f"The mean salary is: {mean_salary}")
print(f"The total salary is: {sum_salary}")
print(f"The max and min salaries respectively are {max_salary}, {min_salary}")

The mean salary is: 49600.0
The total salary is: 248000
The max and min salaries respectively are 55000, 47000

In [44]:
employees.describe()

             Salary
count      5.000000
mean   49600.000000
std     3130.495168
min    47000.000000
25%    48000.000000
50%    49000.000000
75%    49000.000000
max    55000.000000

In [45]:
dict_1

{'key1': 'value', 'key2': 'value'}

In [46]:
employees

  Forename    Surname  Salary                           Job title
0    Dawid      Tycki   48000                Intelligence Analyst
1     Doug      Sharp   49000             BO Intelligence Analyst
2    Soana       Pole   55000  Intelligence Analyst - Team leader
3   Paloma      Casey   49000          MARVE Intelligence Analyst
4     Pete  Leaworthy   47000            SEN Intelligence Analyst

In [47]:
list_of_dicts = [
{'col1':1,
'col2':2},
{'col1':'A',
'col2':'B'},

]
df = pd.DataFrame(list_of_dicts)

In [48]:
df

  col1 col2
0    1    2
1    A    B

In [49]:
filename2 = "https://https://raw.githubusercontent.com/data-to-insight/ERN-sessions/main/data/1980%202023%20average%20house%20prices.csv"
filename2

'https://https://raw.githubusercontent.com/data-to-insight/ERN-sessions/main/data/1980%202023%20average%20house%20prices.csv'

In [50]:
dff = pd.read_csv(filepath)
dff

       CHILD  SEX         DOB ETHNIC            UPN  MOTHER MC_DOB
0     566910    2  27/03/2008   WROM  D051910639385     NaN    NaN
1     384923    2  09/09/2011   REFU  L034811502612     NaN    NaN
2     709901    1  14/02/2013   ABAN  Y021751958510     NaN    NaN
3     550084    2  04/05/2008   AOTH  R095578985099     NaN    NaN
4     710229    2  15/04/2002   REFU  Z095096287583     NaN    NaN
...      ...  ...         ...    ...            ...     ...    ...
2670  152113    1  06/06/2003   WBRI  K096794376750     NaN    NaN
2671  481370    2  12/02/2008   BAFR  C014150452081     NaN    NaN
2672  791577    1  28/05/2011   WBRI  Q009369089812     NaN    NaN
2673  238470    1  21/11/2013   AIND  P095222532769     NaN    NaN
2674  437361    1  15/12/2012   WROM  G018001328504     NaN    NaN

[2675 rows x 7 columns]

In [51]:
print(dff.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2675 entries, 0 to 2674
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   CHILD   2675 non-null   int64
 1   SEX     2675 non-null   int64
 2   DOB     2675 non-null   object
 3   ETHNIC  2675 non-null   object
 4   UPN     2675 non-null   object
 5   MOTHER  1 non-null      float64
 6   MC_DOB  1 non-null      object
dtypes: float64(1), int64(2), object(4)
memory usage: 146.4+ KB
None

In [52]:
filepath = "https://raw.githubusercontent.com/data-to-insight/ERN-sessions/main/data/1980%202023%20average%20house%20prices.csv"
df = pd.read_csv(filepath)
df

,Name,Period,House price index All property types,Average price All property types,Percentage change (monthly) All property types,Percentage change (yearly) All property types
0,United Kingdom,1980-01,10.11,19273,3.94,28.59
1,United Kingdom,1980-02,10.11,19273,3.94,28.59
2,United Kingdom,1980-03,10.11,19273,3.94,28.59
3,United Kingdom,1980-04,10.51,20044,4.00,24.15
4,United Kingdom,1980-05,10.51,20044,4.00,24.15
...,...,...,...,...,...,...
518,United Kingdom,2023-03,148.20,282548,-1.00,3.20
519,United Kingdom,2023-04,148.90,283871,0.50,2.50
520,United Kingdom,2023-05,149.50,285053,0.40,1.60
521,United Kingdom,2023-06,151.20,288281,1.10,1.90
522,United Kingdom,2023-07,152.00,289824,0.50,0.60

In [53]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 523 entries, 0 to 522
Data columns (total 6 columns):
 #   Column                                          Non-Null Count  Dtype
---  ------                                          --------------  -----
 0   Name                                            523 non-null    object
 1   Period                                          523 non-null    object
 2   House price index All property types            523 non-null    float64
 3   Average price All property types                523 non-null    int64
 4   Percentage change (monthly) All property types  523 non-null    float64
 5   Percentage change (yearly) All property types   523 non-null    float64
dtypes: float64(3), int64(1), object(2)
memory usage: 24.6+ KB

In [54]:
# 01/01/2024
# %d/%m/%Y
# strftime  = one way of specifying datetime
# %b - month but with local shortening eg: Jan
# %B - full month name January
df['Period'] = pd.to_datetime(df['Period'],format='%Y-%m',errors='coerce')
df.head()

,Name,Period,House price index All property types,Average price All property types,Percentage change (monthly) All property types,Percentage change (yearly) All property types
0,United Kingdom,1980-01-01,10.11,19273,3.94,28.59
1,United Kingdom,1980-02-01,10.11,19273,3.94,28.59
2,United Kingdom,1980-03-01,10.11,19273,3.94,28.59
3,United Kingdom,1980-04-01,10.51,20044,4.00,24.15
4,United Kingdom,1980-05-01,10.51,20044,4.00,24.15

In [55]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 523 entries, 0 to 522
Data columns (total 6 columns):
 #   Column                                          Non-Null Count  Dtype
---  ------                                          --------------  -----
 0   Name                                            523 non-null    object
 1   Period                                          523 non-null    datetime64[ns]
 2   House price index All property types            523 non-null    float64
 3   Average price All property types                523 non-null    int64
 4   Percentage change (monthly) All property types  523 non-null    float64
 5   Percentage change (yearly) All property types   523 non-null    float64
dtypes: datetime64[ns](1), float64(3), int64(1), object(1)
memory usage: 24.6+ KB

In [56]:
# df['Age of Data (Years)'] = pd.to_datetime('today').normalize() - df['Period'] # normalize() will make it midnight as opposed to the time now
# print(df['Age of Data (Years)'].dtype)

# the above did not work so did this instead
df['Age of Data (Years)'] = pd.to_datetime('09/02/2024',dayfirst=True) - df['Period']
df

,Name,Period,House price index All property types,Average price All property types,Percentage change (monthly) All property types,Percentage change (yearly) All property types,Age of Data (Years)
0,United Kingdom,1980-01-01,10.11,19273,3.94,28.59,16110 days
1,United Kingdom,1980-02-01,10.11,19273,3.94,28.59,16079 days
2,United Kingdom,1980-03-01,10.11,19273,3.94,28.59,16050 days
3,United Kingdom,1980-04-01,10.51,20044,4.00,24.15,16019 days
4,United Kingdom,1980-05-01,10.51,20044,4.00,24.15,15989 days
...,...,...,...,...,...,...,...
518,United Kingdom,2023-03-01,148.20,282548,-1.00,3.20,345 days
519,United Kingdom,2023-04-01,148.90,283871,0.50,2.50,314 days
520,United Kingdom,2023-05-01,149.50,285053,0.40,1.60,284 days
521,United Kingdom,2023-06-01,151.20,288281,1.10,1.90,253 days
522,United Kingdom,2023-07-01,152.00,289824,0.50,0.60,223 days

In [57]:
# import numpy as np
# df['Age of Data (Years)'] = df['Age of Data (Years)'] / pd.Timedelta('365') -- issues with this too

#so instead did this
df['Age of Data (Years)'] = df['Age of Data (Years)'] / pd.Timedelta('365 days')
df['Age of Data (Years)'] = df['Age of Data (Years)'].round().astype('int',errors='ignore')
df

,Name,Period,House price index All property types,Average price All property types,Percentage change (monthly) All property types,Percentage change (yearly) All property types,Age of Data (Years)
0,United Kingdom,1980-01-01,10.11,19273,3.94,28.59,44
1,United Kingdom,1980-02-01,10.11,19273,3.94,28.59,44
2,United Kingdom,1980-03-01,10.11,19273,3.94,28.59,44
3,United Kingdom,1980-04-01,10.51,20044,4.00,24.15,44
4,United Kingdom,1980-05-01,10.51,20044,4.00,24.15,44
...,...,...,...,...,...,...,...
518,United Kingdom,2023-03-01,148.20,282548,-1.00,3.20,1
519,United Kingdom,2023-04-01,148.90,283871,0.50,2.50,1
520,United Kingdom,2023-05-01,149.50,285053,0.40,1.60,1
521,United Kingdom,2023-06-01,151.20,288281,1.10,1.90,1
522,United Kingdom,2023-07-01,152.00,289824,0.50,0.60,1

In [58]:
filepath = "https://raw.githubusercontent.com/data-to-insight/ERN-sessions/main/data/ChildIdentifiers.csv"
df = pd.read_csv(filepath)
df
# df = df[['LAchildID','PersonBirthData','GenderCurrent']]

,Unnamed: 0,LAchildID,UPN,FormerUPN,UPNunknown,PersonBirthDate,ExpectedPersonBirthDate,GenderCurrent,PersonDeathDate
0,0,RND000215205141,A850728973744,NaN,NaN,2019-12-06,NaN,1,NaN
1,1,RND000824303014,A141396438491,NaN,NaN,2011-04-27,NaN,9,NaN
2,2,RND000750143123,A929946861554,NaN,NaN,2017-06-06,2019-12-06,1,NaN
3,3,RND000909164501,A612330267292,NaN,NaN,2014-10-03,NaN,0,NaN
4,4,RND000382171815,A604459366806,NaN,NaN,2019-09-25,NaN,2,NaN
...,...,...,...,...,...,...,...,...,...
327,327,RND000112711501,A465246916125,NaN,NaN,2010-07-07,NaN,2,NaN
328,328,RND000513120794,A540014111973,NaN,NaN,2018-08-14,NaN,2,NaN
329,329,RND000541643134,A549582689058,NaN,NaN,2021-12-09,NaN,51,NaN
330,330,RND000404939452,A889492349196,NaN,NaN,2013-07-23,NaN,2,NaN
331,331,RND000589802835,A877624860226,NaN,NaN,2021-10-25,NaN,9,NaN

In [59]:
df = df[['LAchildID','PersonBirthDate','GenderCurrent']]
df

           LAchildID PersonBirthDate  GenderCurrent
0    RND000215205141      2019-12-06              1
1    RND000824303014      2011-04-27              9
2    RND000750143123      2017-06-06              1
3    RND000909164501      2014-10-03              0
4    RND000382171815      2019-09-25              2
..               ...             ...            ...
327  RND000112711501      2010-07-07              2
328  RND000513120794      2018-08-14              2
329  RND000541643134      2021-12-09             51
330  RND000404939452      2013-07-23              2
331  RND000589802835      2021-10-25              9

[332 rows x 3 columns]

In [60]:
df['PersonBirthDate'] = pd.to_datetime(df['PersonBirthDate'],format='%Y-%m-%d',errors='coerce')

/tmp/ipykernel_1305/2143316482.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['PersonBirthDate'] = pd.to_datetime(df['PersonBirthDate'],format='%Y-%m-%d',errors='coerce')

In [61]:
import numpy as np
df['Age'] = pd.to_datetime('09/02/2024',dayfirst=True) - df['PersonBirthDate']
df['Age'] = (df['Age'] / pd.Timedelta('365 days')).astype('int')
df

/tmp/ipykernel_1305/2953460526.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Age'] = pd.to_datetime('09/02/2024',dayfirst=True) - df['PersonBirthDate']
/tmp/ipykernel_1305/2953460526.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Age'] = (df['Age'] / pd.Timedelta('365 days')).astype('int')

           LAchildID PersonBirthDate  GenderCurrent  Age
0    RND000215205141      2019-12-06              1    4
1    RND000824303014      2011-04-27              9   12
2    RND000750143123      2017-06-06              1    6
3    RND000909164501      2014-10-03              0    9
4    RND000382171815      2019-09-25              2    4
..               ...             ...            ...  ...
327  RND000112711501      2010-07-07              2   13
328  RND000513120794      2018-08-14              2    5
329  RND000541643134      2021-12-09             51    2
330  RND000404939452      2013-07-23              2   10
331  RND000589802835      2021-10-25              9    2

[332 rows x 4 columns]

In [62]:
gender_map = {1:'Male',
              2:'Female',
              0:'Unknown',
              9:'Unknown'}
df['GenderCurrent'] = df['GenderCurrent'].map(gender_map)
df

/tmp/ipykernel_1305/3144501135.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['GenderCurrent'] = df['GenderCurrent'].map(gender_map)

           LAchildID PersonBirthDate GenderCurrent  Age
0    RND000215205141      2019-12-06          Male    4
1    RND000824303014      2011-04-27       Unknown   12
2    RND000750143123      2017-06-06          Male    6
3    RND000909164501      2014-10-03       Unknown    9
4    RND000382171815      2019-09-25        Female    4
..               ...             ...           ...  ...
327  RND000112711501      2010-07-07        Female   13
328  RND000513120794      2018-08-14        Female    5
329  RND000541643134      2021-12-09           NaN    2
330  RND000404939452      2013-07-23        Female   10
331  RND000589802835      2021-10-25       Unknown    2

[332 rows x 4 columns]

In [63]:
under_5s = df['Age']<5
df[under_5s].head()

          LAchildID PersonBirthDate GenderCurrent  Age
0   RND000215205141      2019-12-06          Male    4
4   RND000382171815      2019-09-25        Female    4
5   RND000471630058      2021-04-02       Unknown    2
7   RND000756924984      2021-04-04        Female    2
10  RND000003988611      2022-05-11          Male    1

In [64]:
df['Age']<5

0       True
1      False
2      False
3      False
4       True
       ...
327    False
328    False
329     True
330    False
331     True
Name: Age, Length: 332, dtype: bool

In [65]:
under_5s_male = (df['Age'] <5) & (df['GenderCurrent']=='Male')
df[under_5s_male].head()

           LAchildID PersonBirthDate GenderCurrent  Age
0    RND000215205141      2019-12-06          Male    4
10   RND000003988611      2022-05-11          Male    1
15   RND000616439909      2020-04-06          Male    3
104  RND000063991293      2019-04-21          Male    4
134  RND000403002895      2019-09-27          Male    4

In [66]:
under_5s_or_male = (df['Age'] <5) | (df['GenderCurrent']=='Unkown')
df[under_5s_or_male].head()

          LAchildID PersonBirthDate GenderCurrent  Age
0   RND000215205141      2019-12-06          Male    4
4   RND000382171815      2019-09-25        Female    4
5   RND000471630058      2021-04-02       Unknown    2
7   RND000756924984      2021-04-04        Female    2
10  RND000003988611      2022-05-11          Male    1

In [67]:
df.describe()

                     PersonBirthDate         Age
count                            332  332.000000
mean   2013-06-25 11:03:36.867469824   10.132530
min              2004-08-20 00:00:00    1.000000
25%              2008-09-29 12:00:00    5.000000
50%              2013-10-23 00:00:00   10.000000
75%              2018-03-12 00:00:00   15.000000
max              2022-07-12 00:00:00   19.000000
std                              NaN    5.317181

In [68]:
age_15_or_over_or_male = (df['Age']>=15) | (df['GenderCurrent']=='Male')
age_15_or_over_or_female = (df['Age']<=15) | (df['GenderCurrent']=='Female')
print(df[age_15_or_over_or_male])
print(df[age_15_or_over_or_female])

           LAchildID PersonBirthDate GenderCurrent  Age
0    RND000215205141      2019-12-06          Male    4
2    RND000750143123      2017-06-06          Male    6
10   RND000003988611      2022-05-11          Male    1
15   RND000616439909      2020-04-06          Male    3
19   RND000958425881      2007-07-04          Male   16
..               ...             ...           ...  ...
322  RND000498746591      2008-04-11        Female   15
323  RND000044483554      2020-06-16          Male    3
324  RND000110305262      2022-06-13          Male    1
325  RND000174662411      2005-08-08           NaN   18
326  RND000033895249      2007-12-25       Unknown   16

[148 rows x 4 columns]
           LAchildID PersonBirthDate GenderCurrent  Age
0    RND000215205141      2019-12-06          Male    4
1    RND000824303014      2011-04-27       Unknown   12
2    RND000750143123      2017-06-06          Male    6
3    RND000909164501      2014-10-03       Unknown    9
4    RND000382171815      2019-09-25        Female    4
..               ...             ...           ...  ...
327  RND000112711501      2010-07-07        Female   13
328  RND000513120794      2018-08-14        Female    5
329  RND000541643134      2021-12-09           NaN    2
330  RND000404939452      2013-07-23        Female   10
331  RND000589802835      2021-10-25       Unknown    2

[278 rows x 4 columns]

In [69]:
# condition_3 = ~df['Age'] >=15  # ~ will negate it so it will show everyone not >=15
# con_4 = df['GenderCurrent'].str.lower() == 'male'
# df['GenderCurrent'] = df['GenderCurrent'].str.lower()
# con_5 = df['GenderCurrent'].isin(['male','female'])
# # con_6 = (df[df['GenderCurrent'].str.contains('m')) & (df['GenderCurrent'].notna)]

In [70]:
df[con_6]

NameError: name 'con_6' is not defined